webserver/www/codeigniter4/app/Controllers/Categorias.php

SELECT *
FROM `categorias`
---
    public function index(): string
    {
        $data['title'] = 'Categorias';
        $data['categorias'] = $this->categorias->findAll();