webserver/www/codeigniter4/app/Controllers/Clientes.php

SELECT `clientes`.*, `usuarios`.`usuarios_nome`, `usuarios`.`usuarios_sobrenome`, `usuarios`.`usuarios_cpf`
FROM `clientes`
JOIN `usuarios` ON `clientes`.`clientes_usuario_id` = `usuarios`.`usuarios_id`
---
    public function index(): string
    {
        $data['title'] = 'Clientes';
        $data['clientes'] = $this->clientes->findAll();

SELECT *
FROM `usuarios`
---
    public function new(): string
    {
        $data['title'] = 'Clientes';
        $data['op'] = 'create';
        $data['form'] = 'cadastrar';
        $data['clientes'] = (object) [
            'clientes_id' => '',
            'clientes_usuario_id' => '',
            'clientes_observacoes' => ''
        ];
        $data['usuarios'] = $this->usuarios->findAll();

INSERT INTO `clientes` (`clientes_usuario_id`, `clientes_observacoes`, `created_at`, `updated_at`) VALUES ('3', 'sdsa', '2025-05-28 15:10:06', '2025-05-28 15:10:06')
---
    public function create()
    {
        $this->clientes->save([
            'usuario_id' => $_REQUEST['usuario_id'],
            'clientes_observacoes' => $_REQUEST['clientes_observacoes']
        ]);

DELETE FROM `clientes`
WHERE `clientes_id` IN ('2')
---
    public function delete($id)
    {
        $this->clientes->delete($id);

SELECT *
FROM `clientes`
WHERE `clientes`.`clientes_id` = '3'
SELECT *
FROM `usuarios`
---
    public function edit($id)
    {
        $data['cliente'] = $this->clientes->find($id);
        $data['usuarios'] = $this->usuarios->findAll();