webserver/www/codeigniter4/app/Controllers/Enderecos.php

    public function index(): string
    {
        $data['title'] = 'Endereços';
        $data['enderecos'] = $this->enderecos
            ->join('cidades', 'enderecos_cidade_id = cidades_id')
            ->join('usuarios', 'enderecos_usuario_id = usuarios_id')
            ->findAll();
---
SELECT *
FROM `enderecos`
JOIN `cidades` ON `enderecos_cidade_id` = `cidades_id`
JOIN `usuarios` ON `enderecos_usuario_id` = `usuarios_id`

    public function new(): string
    {
        $data['title'] = 'Novo Endereço';
        $data['op'] = 'create';
        $data['form'] = 'Cadastrar';
        $data['cidades'] = $this->cidades->findAll();
        $data['usuarios'] = $this->usuarios->findAll();
---
SELECT *
FROM `cidades`
SELECT *
FROM `usuarios`