webserver/www/codeigniter4/app/Controllers/Funcionarios.php

    public function index(): string
    {
        $data['title'] = 'Funcionários';
        $data['funcionarios'] = $this->funcionarios->findAll();
---
SELECT `funcionarios`.*, `usuarios`.`usuarios_nome`, `usuarios`.`usuarios_sobrenome`, `usuarios`.`usuarios_cpf`
FROM `funcionarios`
JOIN `usuarios` ON `funcionarios`.`funcionarios_usuario_id` = `usuarios`.`usuarios_id`

    public function new(): string
    {
        $data['title'] = 'Funcionários';
        $data['op'] = 'create';
        $data['form'] = 'cadastrar';
        $data['funcionarios'] = (object) [
            'funcionarios_id' => '',
            'funcionarios_usuario_id' => '',
            'funcionarios_cargo' => '',
            'funcionarios_salario' => '',
            'funcionarios_data_admissao' => '',
            'funcionarios_observacoes' => ''
        ];
        $data['usuarios'] = $this->usuarios->findAll();
---
SELECT *
FROM `usuarios`