webserver/www/codeigniter4/app/Controllers/Home.php

SELECT *
FROM `categorias`
---
    public function index()
    {
        $data['titulo'] = "Home";
        $categorias = $this->categorias->findAll();