webserver/www/codeigniter4/app/Controllers/Usuarios.php

    public function index(): string
    {
        $data['title'] = 'Usuarios';
        $data['usuarios'] = $this->usuarios->findAll();
---
SELECT *
FROM `usuarios`

        }


        $this->usuarios->save([
            'usuarios_nome' => $_REQUEST['usuarios_nome'],
            'usuarios_sobrenome' => $_REQUEST['usuarios_sobrenome'],
            'usuarios_email' => $_REQUEST['usuarios_email'],
            'usuarios_cpf' => $_REQUEST['usuarios_cpf'],
            'usuarios_data_nasc' => $_REQUEST['usuarios_data_nasc'],
            'usuarios_senha' => md5($_REQUEST['usuarios_senha']),
            'usuarios_fone' => $_REQUEST['usuarios_fone'],
            'usuarios_nivel' => 0
        ]);

        $data['msg'] = msg('Cadastrado com Sucesso!','success');
        $data['usuarios'] = $this->usuarios->findAll();
---
INSERT INTO `usuarios` (`usuarios_nome`, `usuarios_sobrenome`, `usuarios_email`, `usuarios_cpf`, `usuarios_data_nasc`, `usuarios_senha`, `usuarios_fone`, `usuarios_nivel`) VALUES ('Cliente', 'Top 2', 'cliente2@gmail.com', '123.488.789-66', '2003-02-01', 'e10adc3949ba59abbe56e057f20f883e', '12457896895', 0)
SELECT *
FROM `usuarios`

    public function edit_nivel(): string
    {
        $data['nivel'] = [
            ['id' => 0, 'nivel' => "Cliente"],
            ['id' => 1, 'nivel' => "Administrador"],
            ['id' => 2, 'nivel' => "Funcionário"]
        ];

        $data['usuarios'] = $this->usuarios->findAll();
        $data['title'] = 'Usuarios';


        $data['usuarios'] = $this->usuarios->findAll();
---
SELECT *
FROM `usuarios`